-- =============================================
-- Задания на дом по SQL
-- Студент: Аристов Иван Сергеевич
-- Дата: 29.09.2026
-- =============================================


-- Задание 1. Самый дорогой товар
SELECT фио, цена FROM Товар ORDER BY цена DESC LIMIT 1;


-- Задание 2. Самый дешёвый товар
SELECT фио, цена FROM Товар ORDER BY цена ASC LIMIT 1;


-- Задание 3. Товары одной категории
SELECT фио, цена FROM Товар WHERE специальность = 'Хирург';


-- Задание 4. Поиск по названию (буква «о»)
SELECT фио FROM Товар WHERE фио LIKE '%о%';


-- Задание 5. Все заказы
SELECT id, дата, клиент, товар_id, количество FROM Заказ;


-- Задание 6. Заказы конкретного клиента
SELECT id, дата, клиент, товар_id, количество FROM Заказ WHERE клиент = 'Иванов Иван Иванович';


-- Задание 7. JOIN — заказы с ФИО врача
SELECT Заказ.дата, Заказ.клиент, Товар.фио, Заказ.количество FROM Заказ JOIN Товар ON Заказ.товар_id = Товар.id;


-- Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество) FROM Заказ JOIN Товар ON Заказ.товар_id = Товар.id;


-- Задание 9. Количество заказов по клиентам
SELECT клиент, COUNT(*) FROM Заказ GROUP BY клиент;


-- Задание 10. Свой запрос
-- Что хочу получить: врачи со стажем больше 15 лет, отсортированные по убыванию стажа
SELECT фио, специальность, стаж FROM Товар WHERE стаж > 15 ORDER BY стаж DESC;