-- Задания на дом по SQL
-- Студент: Аристов Иван Сергеевич
-- Дата: 29.09.2026



-- Задание 1. Самый дорогой товар
SELECT ФИО, цена FROM Товар ORDER BY цена DESC LIMIT 1;


-- Задание 2. Самый дешёвый товар
SELECT ФИО, цена FROM Товар ORDER BY цена ASC LIMIT 1;


-- Задание 3. Товары одной категории (специальности)
SELECT ФИО, цена FROM Товар WHERE специальность = 'Хирург';


-- Задание 4. Поиск по названию
-- Условие: найдите все товары, в названии (ФИО) которых есть буква «о».
SELECT ФИО FROM Товар WHERE ФИО LIKE '%о%';


-- Задание 5. Все заказы
-- Условие: выведите все заказы: id, дата, клиент, товар_id, количество.
SELECT id, Дата, Клиент, Товар_id, Количество FROM Заказ;


-- Задание 6. Заказы конкретного клиента
-- Условие: выведите все заказы клиента «Иванов Иван Иванович».
SELECT id, Дата, Клиент, Товар_id, Количество FROM Заказ WHERE Клиент = 'Иванов Иван Иванович';


-- Задание 7. JOIN — заказы с названиями товаров
-- Условие: выведите дату, клиента, ФИО врача и количество.
SELECT Заказ.Дата, Заказ.Клиент, Товар.ФИО, Заказ.Количество FROM Заказ JOIN Товар ON Заказ.Товар_id = Товар.id;


-- Задание 8. Общая сумма всех заказов
-- Условие: посчитайте итоговую сумму всех заказов: Товар.цена × Заказ.Количество.
SELECT SUM(Товар.цена * Заказ.Количество) FROM Заказ JOIN Товар ON Заказ.Товар_id = Товар.id;


-- Задание 9. Количество заказов по клиентам
-- Условие: для каждого клиента посчитайте, сколько у него заказов.
SELECT Клиент, COUNT(*) FROM Заказ GROUP BY Клиент;


-- Задание 10. Свой запрос
-- Что хочу получить: всех врачей со стажем больше 15 лет, отсортированных по убыванию стажа
SELECT ФИО, специальность, стаж FROM Товар WHERE стаж > 15 ORDER BY стаж DESC;